#!/usr/bin/python
# -*- coding: UTF-8 -*-
"""
Created on 2017-1-20

@author: sapphire

字典(dictionary)是除列表以外python之中最灵活的内置数据结构类型。列表是有序的对象结合，字典是无序的对象集合。
两者之间的区别在于：字典当中的元素是通过键来存取的，而不是通过偏移存取。
字典用"{ }"标识。字典由索引(key)和它对应的值value组成。

字典是另一种可变容器模型，且可存储任意类型对象。
字典的每个键值(key=>value)对用冒号(:)分割，每个对之间用逗号(,)分割，整个字典包括在花括号({})中 ,格式如下所示：
"""


# 基本操作
def base_operator():
    """
---------------------------------------------------------------------------------------------------
    例：打印常用的dict基本操作
---------------------------------------------------------------------------------------------------
    字典值可以没有限制地取任何python对象，既可以是标准的对象，也可以是用户定义的，但键不行。
    两个重要的点需要记住：
    1）不允许同一个键出现两次。创建时如果同一个键被赋值两次，后一个值会被记住
    2）键必须不可变，所以可以用数字，字符串或元组充当，所以用列表就不行
---------------------------------------------------------------------------------------------------
    :return:
    """

    dict1 = {'Name': 'Zara', 'Age': 7, 'Class': 'First'}
    # 访问
    print("dict['Name']             : ", dict1['Name'])
    print("dict['Age']              : ", dict1['Age'])

    # 如果用字典里没有的键访问数据，KeyError: 'Sex'
    # print("dict['Sex']              : ", dict1['Sex'])

    # 修改
    dict1['Age'] = 8  # update existing entry
    dict1['School'] = "DPS School"  # Add new entry

    print("dict['Age']: ", dict1['Age'])
    print("dict['School']: ", dict1['School'])

    # 删除
    del dict1['Name']  # 删除键是'Name'的条目
    dict1.clear()  # 清空词典所有条目
    del dict1  # 删除词典


# 内建函数和列表函数
def built_in_and_dict_function():
    """
---------------------------------------------------------------------------------------------------
    例：常用的dict内建函数和列表函数
---------------------------------------------------------------------------------------------------
    :return:
    """
    dict2 = {}
    dict3 = {'name': 'john', 'code': 6734, 'dept': 'sales'}

    dict2['one'] = "This is one"
    dict2[2] = "This is two"

    print(dict2['one'])  # 输出键为'one' 的值
    print(dict2[2])  # 输出键为 2 的值
    print(dict3)  # 输出完整的字典
    print(dict3.keys())  # 输出所有键
    print(dict3.values())  # 输出所有值


print(__doc__)

print('''
===================================================================================================
=                                           Base Operator                                         =
===================================================================================================
''')

# 基本操作
print(base_operator.__doc__)
base_operator()

print('''
===================================================================================================
=                                    Built-in And Dict Function                                   =
===================================================================================================
''')

# 内建函数和列表函数
print(built_in_and_dict_function.__doc__)
built_in_and_dict_function()

print('''
===================================================================================================
=                                              Closed                                             =
===================================================================================================
''')
